---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLServiceType
source: html/b32c72d5-72bf-67a0-d669-9c43faa94eeb.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLServiceType

This enumeration corresponds to the systemType attribute in gbXML
 and is used for specifying the service for the building or space.

## Syntax (C#)
```csharp
public enum gbXMLServiceType
```